export const profile = {
  name: "김창주",
  role: "Front-end Developer",
  email: "micayell98@naver.com",
  github: "https://github.com/micayell",
  blog: "https://micayell98.tistory.com/",

  description: [
    "'삼성 청년 SW•AI 아카데미'에서 3번의 6인 프로젝트를 진행하면서 제가 직접 기획하고 디자인한 아이디어를 코드로 실현하는 과정에 매료되어 해당 직무에 지원하게 되었습니다.",
    "이를 위해 저는 사용자가 서비스를 마주하는 '그 짧은 순간'의 경험을 개선하는 데 노력을 해 왔는데요.",
    "첫째, 데이터 로딩 경험을 개선했습니다. Zustand와 React-Query를 도입하여 클라이언트와 서버 상태를 명확히 분리했고, 이를 통해 미리 기존의 화면을 보여주고 서버에서 비동기적으로 데이터를 갖고 와 사용자가 대기 시간 없이 즉각적인 화면을 볼 수 있도록 구현했습니다.",
    "둘째, 렌더링 최적화 경험이 있습니다. 다양한 AI를 활용한 웹 게임 프로젝트에서 모델링 로딩 병목 현상을 Three.js를 활용하여 렌더링 시간을 단축시켰고, 이를 통해 사용자 경험을 개선시킨 경험이 있습니다.",
    "이를 공로로 인정 받아 SSAFY에서는 우수상을 2회 수상하였습니다.",
    "입사 후에도 이러한 강점과 더불어 FSD, FSD+Atomic, Component 기반 패턴으로 프로젝트 성격마다 다르게 아키텍처를 가져간 경험을 통해 회사의 기존 아키텍처와 컨벤션에 빠르게 적응하여 즉시 전력으로 기여하겠습니다. 감사합니다.",
  ],
};

export const education = [
  {
    school: "삼성청년 SW•AI 아카데미",
    period: "2025.01 ~ 2025.12",
    desc: "13기 수료 (코딩 집중과정 820시간, )",
  },
  {
    school: "전남대학교 (산업공학)",
    period: "2017.03 ~ 2024.08",
    desc: "학사 졸업 (빅데이터금융공학 복수전공)",
  },
];

export const awards = [
  {
    title: "자율 프로젝트 우수상",
    org: "삼성청년 SW•AI아카데미",
    date: "2025.11",
  },
  {
    title: "특화 프로젝트 우수상",
    org: "삼성청년 SW•AI아카데미",
    date: "2025.9",
  },
  { title: "정보처리기사", org: "한국산업인력공단", date: "2024.06" },
  { title: "재무빅데이터분석사 2급", org: "한국공인회계사회", date: "2024.06" },
  { title: "TOEIC 810", org: "", date: "" },
];
